### Backend Terraform Plan
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

module.event_planr_db.random_password.this: Refreshing state... [id=none]
module.lambda_apis["event_invitation_api"].data.archive_file.this: Reading...
module.chat_message_resolver_lambda.data.archive_file.this: Reading...
module.lambda_apis["news_post_manager_api"].data.archive_file.this: Reading...
module.lambda_apis["ticket_manager_api"].data.archive_file.this: Reading...
module.lambda_apis["user_ticket_api"].data.archive_file.this: Reading...
module.lambda_apis["event_general_api"].data.archive_file.this: Reading...
module.database_initializer_lambda.data.archive_file.this: Reading...
module.lambda_apis["chat_manager_api"].data.archive_file.this: Reading...
module.lambda_apis["ticket_order_api"].data.archive_file.this: Reading...
module.lambda_apis["event_manager_api"].data.archive_file.this: Reading...
module.lambda_apis["news_post_manager_api"].data.archive_file.this: Read complete after 4s [id=eb9e394d49437e6056379d4597e4c2968171af77]
module.lambda_apis["chat_manager_api"].data.archive_file.this: Read complete after 4s [id=a28e210d87db6ad251253e83fc904ac6a898faed]
module.lambda_apis["event_general_api"].data.archive_file.this: Read complete after 4s [id=efe6c4b96e9f36a1fd66a30f91697c8e24d52987]
module.reserved_ticket_order_expiration.data.archive_file.this: Reading...
module.pre_token_generation_lambda.data.archive_file.this: Reading...
module.lambda_apis["organization_manager_api"].data.archive_file.this: Reading...
module.database_initializer_lambda.data.archive_file.this: Read complete after 4s [id=280a7dcbae1a60c2da6a0ef4dff44c183745f8e1]
aws_ssm_parameter.nominatim_api_url: Refreshing state... [id=/production/event_planr/nominatimApiUrl]
module.lambda_apis["user_ticket_api"].data.archive_file.this: Read complete after 5s [id=f0574657a3e83715eae3a6522e986db28c078a9a]
module.chat_message_resolver_lambda.data.archive_file.this: Read complete after 5s [id=c8a9e8662087380659fc20fb2f94d4ab7a0045b9]
data.aws_iam_policy_document.logging: Reading...
aws_ssm_parameter.aws_region: Refreshing state... [id=/production/event_planr/awsRegion]
data.aws_iam_policy_document.logging: Read complete after 0s [id=16712114]
data.aws_iam_policy_document.appsync_assume_role: Reading...
data.aws_iam_policy_document.appsync_assume_role: Read complete after 0s [id=1521073266]
module.event_planr_api.aws_apigatewayv2_api.this: Refreshing state... [id=htrietjnme]
data.aws_iam_policy_document.lambda_assume_role: Reading...
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.event_planr_db.aws_vpc.this: Refreshing state... [id=vpc-0b22d23f17e7d14cf]
module.lambda_apis["event_invitation_api"].data.archive_file.this: Read complete after 5s [id=f12949f4f02abed84ac42c2a394717f56cb4ffa2]
module.event_planr_db.data.aws_availability_zones.available: Reading...
module.lambda_apis["ticket_manager_api"].data.archive_file.this: Read complete after 5s [id=6fab1a134b15ceaae72d8f4691575dbe66f13802]
module.lambda_apis["ticket_order_api"].data.archive_file.this: Read complete after 5s [id=966db4cf08ecc3535f73500036b5e687bbec5ecf]
aws_s3_bucket.event_planr_images: Refreshing state... [id=production-event-planr-images-bucket]
aws_dynamodb_table.user_claim: Refreshing state... [id=production_UserClaim]
aws_dynamodb_table.chat_message: Refreshing state... [id=production_ChatMessage]
data.aws_caller_identity.default: Reading...
data.aws_caller_identity.default: Read complete after 0s [id=442019309462]
aws_sqs_queue.reserved_ticket_order_expiration_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/442019309462/production_reserved_ticket_order_expiration_queue]
module.event_planr_db.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.user_reserved_ticket_order: Refreshing state... [id=production_UserReservedTicketOrder]
module.event_planr_api.data.aws_region.current: Reading...
module.event_planr_api.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_iam_role.appsync_role: Refreshing state... [id=production_appsync_role]
module.event_planr_api.aws_apigatewayv2_stage.example: Refreshing state... [id=$default]
aws_iam_role.lambda_role: Refreshing state... [id=production_event_planr_lambda_role]
data.aws_iam_policy_document.read_parameter_store: Reading...
data.aws_iam_policy_document.read_parameter_store: Read complete after 0s [id=597567915]
data.aws_iam_policy_document.user_claim_table_access: Reading...
data.aws_iam_policy_document.user_claim_table_access: Read complete after 0s [id=2089743772]
aws_ssm_parameter.user_claim: Refreshing state... [id=/production/event_planr/DynamoDbTableOptions/UserClaimTable]
aws_ssm_parameter.user_reserved_ticket_order: Refreshing state... [id=/production/event_planr/DynamoDbTableOptions/UserReservedTicketOrderTable]
data.aws_iam_policy_document.user_reserved_ticket_order_table_access: Reading...
data.aws_iam_policy_document.user_reserved_ticket_order_table_access: Read complete after 0s [id=3843575910]
aws_ssm_parameter.chat_message: Refreshing state... [id=/production/event_planr/DynamoDbTableOptions/ChatMessageTable]
data.aws_iam_policy_document.chat_message_table_access: Reading...
data.aws_iam_policy_document.chat_message_table_access: Read complete after 0s [id=2980534377]
data.aws_iam_policy_document.reserved_ticket_order_expiration_queue_access: Reading...
data.aws_iam_policy_document.reserved_ticket_order_expiration_queue_access: Read complete after 0s [id=574212101]
aws_ssm_parameter.event_planr_api_url: Refreshing state... [id=/production/event_planr/eventPlanrApiUrl]
module.lambda_apis["event_manager_api"].data.archive_file.this: Read complete after 3s [id=74dee3af25b64fd7a053135c3200a05fa0d1d539]
aws_ssm_parameter.reserved_ticket_order_expiration_queue: Refreshing state... [id=/production/event_planr/SqsQueueOptions/ReservedTicketOrderExpirationQueueName]
module.event_planr_db.aws_subnet.this[1]: Refreshing state... [id=subnet-018decea25c7208b6]
module.event_planr_db.aws_internet_gateway.this: Refreshing state... [id=igw-080cbb6be0fd2aafa]
module.event_planr_db.aws_subnet.this[0]: Refreshing state... [id=subnet-0c2a67c8bdaf1acea]
module.event_planr_db.aws_security_group.this: Refreshing state... [id=sg-0f5fa043fe8a00f2d]
aws_s3_bucket_public_access_block.event_planr_images: Refreshing state... [id=production-event-planr-images-bucket]
data.aws_iam_policy_document.allow_public_access: Reading...
data.aws_iam_policy_document.allow_public_access: Read complete after 0s [id=2969255943]
aws_s3_bucket_cors_configuration.event_planr_images: Refreshing state... [id=production-event-planr-images-bucket]
aws_ssm_parameter.event_planr_images: Refreshing state... [id=/production/event_planr/S3BucketOptions/EventPlanrImagesBucket]
data.aws_iam_policy_document.event_planr_images_bucket_access: Reading...
data.aws_iam_policy_document.event_planr_images_bucket_access: Read complete after 0s [id=3017783229]
aws_s3_bucket_policy.event_planr_images: Refreshing state... [id=production-event-planr-images-bucket]
module.event_planr_db.aws_route.this: Refreshing state... [id=r-rtb-0b31c3bb842495d711080289494]
module.event_planr_db.aws_db_subnet_group.this: Refreshing state... [id=production-event-planr-cluster_subnet]
aws_iam_role_policy.user_claim_table_access: Refreshing state... [id=production_event_planr_lambda_role:user_claim_table_access]
aws_iam_role_policy.event_planr_images_bucket_access: Refreshing state... [id=production_event_planr_lambda_role:event_planr_images_bucket_access]
aws_iam_role_policy.logging: Refreshing state... [id=production_event_planr_lambda_role:logging]
aws_iam_role_policy.read_parameter_store: Refreshing state... [id=production_event_planr_lambda_role:read_parameter_store]
aws_iam_role_policy.reserved_ticket_order_expiration_queue_access: Refreshing state... [id=production_event_planr_lambda_role:reserved_ticket_order_expiration_queue_access]
aws_iam_role_policy.chat_message_table_access: Refreshing state... [id=production_event_planr_lambda_role:chat_message_table_access]
aws_iam_role_policy.user_reserved_ticket_order_table_access: Refreshing state... [id=production_event_planr_lambda_role:user_reserved_ticket_order_table_access]
module.database_initializer_lambda.aws_lambda_function.this: Refreshing state... [id=production_database_initializer_function]
module.chat_message_resolver_lambda.aws_lambda_function.this: Refreshing state... [id=production_chat_message_resolver_function]
module.event_planr_db.aws_rds_cluster.this: Refreshing state... [id=production-event-planr-cluster]
data.aws_iam_policy_document.chat_message_resolver_lambda_access: Reading...
data.aws_iam_policy_document.chat_message_resolver_lambda_access: Read complete after 0s [id=2500903817]
aws_iam_role_policy.chat_message_resolver_lambda_access: Refreshing state... [id=production_appsync_role:chat_message_resolver_lambda_access]
aws_ssm_parameter.event_planr_db: Refreshing state... [id=/production/event_planr/ConnectionStrings/EventPlanrDb]
module.event_planr_db.aws_rds_cluster_instance.this[0]: Refreshing state... [id=tf-20231113234205187000000001]
module.reserved_ticket_order_expiration.data.archive_file.this: Read complete after 3s [id=860688bde384ad12eed2b025d1b0c4edba2b10c6]
module.lambda_apis["organization_manager_api"].data.archive_file.this: Read complete after 3s [id=16a663509f6bf33991c3fbe92d4eb347cd4c41d7]
module.lambda_apis["event_manager_api"].aws_lambda_function.this: Refreshing state... [id=production_event_manager_api]
module.reserved_ticket_order_expiration.aws_lambda_function.this: Refreshing state... [id=production_reserved_ticket_order_expiration_function]
module.lambda_apis["event_general_api"].aws_lambda_function.this: Refreshing state... [id=production_event_general_api]
module.lambda_apis["ticket_order_api"].aws_lambda_function.this: Refreshing state... [id=production_ticket_order_api]
module.lambda_apis["organization_manager_api"].aws_lambda_function.this: Refreshing state... [id=production_organization_manager_api]
module.lambda_apis["ticket_manager_api"].aws_lambda_function.this: Refreshing state... [id=production_ticket_manager_api]
module.lambda_apis["news_post_api"].aws_lambda_function.this: Refreshing state... [id=production_news_post_api]
module.lambda_apis["user_ticket_api"].aws_lambda_function.this: Refreshing state... [id=production_user_ticket_api]
module.lambda_apis["chat_manager_api"].aws_lambda_function.this: Refreshing state... [id=production_chat_manager_api]
module.pre_token_generation_lambda.data.archive_file.this: Read complete after 3s [id=5cf09e1f455c88a0cf39d070591c626abea4be6e]
aws_lambda_invocation.database_initializer_lambda: Refreshing state... [id=production_database_initializer_function_$LATEST_d41d8cd98f00b204e9800998ecf8427e]
module.pre_token_generation_lambda.aws_lambda_function.this: Refreshing state... [id=production_pre_token_generation_function]
aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=e727c7db-4f94-4648-a329-77ed29850aed]
module.event_planr_auth.aws_cognito_user_pool.this: Refreshing state... [id=us-east-1_y6Sn6peiV]
module.event_planr_api.aws_lambda_permission.this["/userticket"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/ticketorder"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/organizationmanager"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/eventmanager"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/chatmanager"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/ticketmanager"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/newspost"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_lambda_permission.this["/eventgeneral"]: Refreshing state... [id=allow_execution_from_api_gateway]
module.event_planr_api.aws_apigatewayv2_integration.this["/ticketorder"]: Refreshing state... [id=qiai3l7]
module.event_planr_api.aws_apigatewayv2_integration.this["/ticketmanager"]: Refreshing state... [id=6gl1z40]
module.event_planr_api.aws_apigatewayv2_integration.this["/newspost"]: Refreshing state... [id=svxp908]
module.event_planr_api.aws_apigatewayv2_integration.this["/eventgeneral"]: Refreshing state... [id=13snc60]
module.event_planr_api.aws_apigatewayv2_integration.this["/userticket"]: Refreshing state... [id=1hvcdj1]
module.event_planr_api.aws_apigatewayv2_integration.this["/organizationmanager"]: Refreshing state... [id=f1e37bt]
module.event_planr_api.aws_apigatewayv2_integration.this["/eventmanager"]: Refreshing state... [id=ej7ze39]
module.event_planr_api.aws_apigatewayv2_integration.this["/chatmanager"]: Refreshing state... [id=99dz5zb]
module.event_planr_api.aws_apigatewayv2_route.swagger["/chatmanager"]: Refreshing state... [id=f1wgkn5]
module.event_planr_api.aws_apigatewayv2_route.swagger["/ticketmanager"]: Refreshing state... [id=ia5e9dt]
module.event_planr_api.aws_apigatewayv2_route.swagger["/userticket"]: Refreshing state... [id=5ixvn1s]
module.event_planr_api.aws_apigatewayv2_route.swagger["/eventgeneral"]: Refreshing state... [id=1n0gck7]
module.event_planr_api.aws_apigatewayv2_route.swagger["/newspost"]: Refreshing state... [id=zfyqfiq]
module.event_planr_api.aws_apigatewayv2_route.swagger["/ticketorder"]: Refreshing state... [id=z2td9kt]
module.event_planr_api.aws_apigatewayv2_route.swagger["/eventmanager"]: Refreshing state... [id=rjcxvvr]
module.event_planr_api.aws_apigatewayv2_route.swagger["/organizationmanager"]: Refreshing state... [id=ezx5xeq]
module.event_planr_auth.aws_lambda_permission.allow_execution_from_cognito: Refreshing state... [id=allow_execution_from_cognito]
data.aws_iam_policy_document.cognito_list_users_access: Reading...
module.event_planr_auth.aws_cognito_user_pool_client.mobile: Refreshing state... [id=3nuhs38nbfl0kbed37tgqffv5o]
aws_ssm_parameter.cognito_user_pool_id: Refreshing state... [id=/production/event_planr/CognitoUserPoolOptions/UserPoolId]
data.aws_iam_policy_document.cognito_list_users_access: Read complete after 0s [id=2227265011]
aws_appsync_graphql_api.chat_message: Refreshing state... [id=bvgh32radjfvtlqucp3ckcbep4]
aws_iam_role_policy.cognito_list_users_access: Refreshing state... [id=production_event_planr_lambda_role:cognito_list_users_access]
aws_ssm_parameter.cognito_pool_id: Refreshing state... [id=/production/event_planr/cognitoPoolId]
aws_ssm_parameter.cognito_pool_client_id: Refreshing state... [id=/production/event_planr/cognitoPoolClientId]
module.event_planr_api.aws_apigatewayv2_authorizer.this[0]: Refreshing state... [id=a2dwbj]
module.event_planr_api.aws_apigatewayv2_route.main_post["/newspost"]: Refreshing state... [id=shl8nuu]
module.event_planr_api.aws_apigatewayv2_route.main_post["/eventmanager"]: Refreshing state... [id=aqv8hsg]
module.event_planr_api.aws_apigatewayv2_route.main_post["/eventgeneral"]: Refreshing state... [id=cif0hwn]
module.event_planr_api.aws_apigatewayv2_route.main_post["/organizationmanager"]: Refreshing state... [id=i21t3vr]
module.event_planr_api.aws_apigatewayv2_route.main_post["/chatmanager"]: Refreshing state... [id=ae1vk7j]
module.event_planr_api.aws_apigatewayv2_route.main_post["/userticket"]: Refreshing state... [id=uzjqfcc]
module.event_planr_api.aws_apigatewayv2_route.main_post["/ticketmanager"]: Refreshing state... [id=95d8zmj]
module.event_planr_api.aws_apigatewayv2_route.main_post["/ticketorder"]: Refreshing state... [id=duv9mfi]
module.event_planr_api.aws_apigatewayv2_route.child_post["/ticketorder"]: Refreshing state... [id=sqr7qni]
module.event_planr_api.aws_apigatewayv2_route.child_post["/organizationmanager"]: Refreshing state... [id=3cejmfa]
module.event_planr_api.aws_apigatewayv2_route.child_post["/ticketmanager"]: Refreshing state... [id=zt3bbjp]
module.event_planr_api.aws_apigatewayv2_route.child_post["/chatmanager"]: Refreshing state... [id=g76ydbc]
module.event_planr_api.aws_apigatewayv2_route.child_post["/eventgeneral"]: Refreshing state... [id=n3jvf4h]
module.event_planr_api.aws_apigatewayv2_route.child_post["/newspost"]: Refreshing state... [id=qvfy3mq]
module.event_planr_api.aws_apigatewayv2_route.child_post["/userticket"]: Refreshing state... [id=rzu71vl]
module.event_planr_api.aws_apigatewayv2_route.child_post["/eventmanager"]: Refreshing state... [id=bs3zn00]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/chatmanager"]: Refreshing state... [id=asvn3o1]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/ticketmanager"]: Refreshing state... [id=9k2fjbe]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/ticketorder"]: Refreshing state... [id=3sgtrg0]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/organizationmanager"]: Refreshing state... [id=h9jkhls]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/newspost"]: Refreshing state... [id=3ibzdc8]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/eventmanager"]: Refreshing state... [id=zw3da35]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/eventgeneral"]: Refreshing state... [id=dabjs3u]
module.event_planr_api.aws_apigatewayv2_route.child_delete["/userticket"]: Refreshing state... [id=lyaz85r]
module.event_planr_api.aws_apigatewayv2_route.main_get["/newspost"]: Refreshing state... [id=vqqebjm]
module.event_planr_api.aws_apigatewayv2_route.main_get["/ticketmanager"]: Refreshing state... [id=7oypfyf]
module.event_planr_api.aws_apigatewayv2_route.main_get["/eventgeneral"]: Refreshing state... [id=wqkpxua]
module.event_planr_api.aws_apigatewayv2_route.main_get["/organizationmanager"]: Refreshing state... [id=1fd1up1]
module.event_planr_api.aws_apigatewayv2_route.main_get["/userticket"]: Refreshing state... [id=4pe21l4]
module.event_planr_api.aws_apigatewayv2_route.main_get["/chatmanager"]: Refreshing state... [id=cphegg2]
module.event_planr_api.aws_apigatewayv2_route.main_get["/eventmanager"]: Refreshing state... [id=yq7oifa]
module.event_planr_api.aws_apigatewayv2_route.main_get["/ticketorder"]: Refreshing state... [id=6wqh4xa]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/userticket"]: Refreshing state... [id=kjnn3zm]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/eventmanager"]: Refreshing state... [id=3lhbatb]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/ticketorder"]: Refreshing state... [id=xmr74in]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/ticketmanager"]: Refreshing state... [id=w5j0ktl]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/chatmanager"]: Refreshing state... [id=rti6xd2]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/eventgeneral"]: Refreshing state... [id=q9285a8]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/organizationmanager"]: Refreshing state... [id=1lmds1t]
module.event_planr_api.aws_apigatewayv2_route.main_delete["/newspost"]: Refreshing state... [id=6re34v7]
module.event_planr_api.aws_apigatewayv2_route.child_put["/organizationmanager"]: Refreshing state... [id=jn67m3l]
module.event_planr_api.aws_apigatewayv2_route.child_put["/ticketmanager"]: Refreshing state... [id=hrs1kan]
module.event_planr_api.aws_apigatewayv2_route.child_put["/eventgeneral"]: Refreshing state... [id=mubhjo2]
module.event_planr_api.aws_apigatewayv2_route.child_put["/newspost"]: Refreshing state... [id=1hjzt2q]
module.event_planr_api.aws_apigatewayv2_route.child_put["/chatmanager"]: Refreshing state... [id=f44v1u9]
module.event_planr_api.aws_apigatewayv2_route.child_put["/eventmanager"]: Refreshing state... [id=ma4r2i7]
module.event_planr_api.aws_apigatewayv2_route.child_put["/userticket"]: Refreshing state... [id=vg558vh]
module.event_planr_api.aws_apigatewayv2_route.child_put["/ticketorder"]: Refreshing state... [id=5q8692j]
module.event_planr_api.aws_apigatewayv2_route.main_put["/chatmanager"]: Refreshing state... [id=vgs8vu2]
module.event_planr_api.aws_apigatewayv2_route.main_put["/userticket"]: Refreshing state... [id=0nv8rm6]
module.event_planr_api.aws_apigatewayv2_route.main_put["/newspost"]: Refreshing state... [id=iqatnvj]
module.event_planr_api.aws_apigatewayv2_route.main_put["/eventgeneral"]: Refreshing state... [id=fu0hbil]
module.event_planr_api.aws_apigatewayv2_route.main_put["/ticketorder"]: Refreshing state... [id=nfb4bu1]
module.event_planr_api.aws_apigatewayv2_route.main_put["/organizationmanager"]: Refreshing state... [id=xcdyq9b]
module.event_planr_api.aws_apigatewayv2_route.main_put["/eventmanager"]: Refreshing state... [id=bj5xr09]
module.event_planr_api.aws_apigatewayv2_route.main_put["/ticketmanager"]: Refreshing state... [id=ctbg9nt]
module.event_planr_api.aws_apigatewayv2_route.child_get["/chatmanager"]: Refreshing state... [id=3izz7p3]
module.event_planr_api.aws_apigatewayv2_route.child_get["/ticketorder"]: Refreshing state... [id=ba039fn]
module.event_planr_api.aws_apigatewayv2_route.child_get["/eventgeneral"]: Refreshing state... [id=44pp013]
module.event_planr_api.aws_apigatewayv2_route.child_get["/organizationmanager"]: Refreshing state... [id=9sna6q5]
module.event_planr_api.aws_apigatewayv2_route.child_get["/newspost"]: Refreshing state... [id=pz27g56]
module.event_planr_api.aws_apigatewayv2_route.child_get["/eventmanager"]: Refreshing state... [id=pbzzkal]
module.event_planr_api.aws_apigatewayv2_route.child_get["/ticketmanager"]: Refreshing state... [id=xrb1kwb]
module.event_planr_api.aws_apigatewayv2_route.child_get["/userticket"]: Refreshing state... [id=vjti5u5]
aws_ssm_parameter.chat_message_graphql_url: Refreshing state... [id=/production/event_planr/chatMessageGraphqlUrl]
aws_appsync_datasource.chat_message: Refreshing state... [id=bvgh32radjfvtlqucp3ckcbep4-production_chat_message]
aws_appsync_resolver.chat_message_query: Refreshing state... [id=bvgh32radjfvtlqucp3ckcbep4-Query-getChatMessages]
aws_appsync_resolver.chat_message_mutation: Refreshing state... [id=bvgh32radjfvtlqucp3ckcbep4-Mutation-createMessage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_invocation.database_initializer_lambda must be replaced
-/+ resource "aws_lambda_invocation" "database_initializer_lambda" {
      ~ id              = "production_database_initializer_function_$LATEST_d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)
      + result          = (known after apply)
      ~ triggers        = { # forces replacement
          - "always_run" = "2023-11-13T23:51:18Z"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.chat_message_resolver_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_chat_message_resolver_function"
      ~ last_modified                  = "2023-11-13T14:25:47.361+0000" -> (known after apply)
      ~ source_code_hash               = "asgvA9bLWHBst/qcQMT6qC37WWdVZ9arveNIqyRWpLY=" -> "+P5FIblnHdXdNHoSnvTqdDETIDacbFDKqMKG+iCt84s="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.database_initializer_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_database_initializer_function"
      ~ last_modified                  = "2023-11-13T15:43:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y+WC8p2uRT3qxi//PuRmJj2yu6pY7WB+xi7jJ3BAhz4=" -> "vis2McxSLA4W3T8WNoud+mCNuKsSW+OZtz/b93LJ8lY="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.event_planr_api.aws_apigatewayv2_integration.this["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "htrietjnme"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_integration.this["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_integration" "this" {
      - api_id                 = "htrietjnme" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "svxp908" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:442019309462:function:production_news_post_api/invocations" -> null
      - payload_format_version = "2.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # module.event_planr_api.aws_apigatewayv2_integration.this["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "htrietjnme"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_delete["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "child_delete" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "DELETE /eventinvitation/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_delete["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "child_delete" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "3ibzdc8" -> null
      - request_models       = {} -> null
      - route_key            = "DELETE /newspost/{proxy+}" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_delete["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "child_delete" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "DELETE /newspostmanager/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_get["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "child_get" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "GET /eventinvitation/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_get["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "child_get" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "pz27g56" -> null
      - request_models       = {} -> null
      - route_key            = "GET /newspost/{proxy+}" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_get["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "child_get" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "GET /newspostmanager/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_post["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "child_post" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "POST /eventinvitation/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_post["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "child_post" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "qvfy3mq" -> null
      - request_models       = {} -> null
      - route_key            = "POST /newspost/{proxy+}" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_post["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "child_post" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "POST /newspostmanager/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_put["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "child_put" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "PUT /eventinvitation/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_put["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "child_put" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "1hjzt2q" -> null
      - request_models       = {} -> null
      - route_key            = "PUT /newspost/{proxy+}" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.child_put["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "child_put" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "PUT /newspostmanager/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_delete["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "main_delete" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "DELETE /eventinvitation"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_delete["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "main_delete" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "6re34v7" -> null
      - request_models       = {} -> null
      - route_key            = "DELETE /newspost" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_delete["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "main_delete" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "DELETE /newspostmanager"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_get["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "main_get" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "GET /eventinvitation"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_get["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "main_get" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "vqqebjm" -> null
      - request_models       = {} -> null
      - route_key            = "GET /newspost" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_get["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "main_get" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "GET /newspostmanager"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_post["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "main_post" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "POST /eventinvitation"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_post["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "main_post" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "shl8nuu" -> null
      - request_models       = {} -> null
      - route_key            = "POST /newspost" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_post["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "main_post" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "POST /newspostmanager"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_put["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "main_put" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "PUT /eventinvitation"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_put["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "main_put" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "a2dwbj" -> null
      - id                   = "iqatnvj" -> null
      - request_models       = {} -> null
      - route_key            = "PUT /newspost" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.main_put["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "main_put" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "a2dwbj"
      + id                 = (known after apply)
      + route_key          = "PUT /newspostmanager"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.swagger["/eventinvitation"] will be created
  + resource "aws_apigatewayv2_route" "swagger" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /eventinvitation/swagger/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_apigatewayv2_route.swagger["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_apigatewayv2_route" "swagger" {
      - api_id               = "htrietjnme" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "zfyqfiq" -> null
      - request_models       = {} -> null
      - route_key            = "GET /newspost/swagger/{proxy+}" -> null
      - target               = "integrations/svxp908" -> null
    }

  # module.event_planr_api.aws_apigatewayv2_route.swagger["/newspostmanager"] will be created
  + resource "aws_apigatewayv2_route" "swagger" {
      + api_id             = "htrietjnme"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /newspostmanager/swagger/{proxy+}"
      + target             = (known after apply)
    }

  # module.event_planr_api.aws_lambda_permission.this["/eventinvitation"] will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:442019309462:htrietjnme/*/*"
      + statement_id        = "allow_execution_from_api_gateway"
      + statement_id_prefix = (known after apply)
    }

  # module.event_planr_api.aws_lambda_permission.this["/newspost"] will be destroyed
  # (because key ["/newspost"] is not in for_each map)
  - resource "aws_lambda_permission" "this" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "production_news_post_api" -> null
      - id            = "allow_execution_from_api_gateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:442019309462:htrietjnme/*/*" -> null
      - statement_id  = "allow_execution_from_api_gateway" -> null
    }

  # module.event_planr_api.aws_lambda_permission.this["/newspostmanager"] will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:442019309462:htrietjnme/*/*"
      + statement_id        = "allow_execution_from_api_gateway"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_apis["chat_manager_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_chat_manager_api"
      ~ last_modified                  = "2023-11-13T14:27:06.808+0000" -> (known after apply)
      ~ source_code_hash               = "bPLzqYtGBrIzzdtspF9FN1PZgjFs3gNrQtIfvArSS0Y=" -> "RUiXL58767p8sWiOL6+pKGuBcgYgCkmWuJ9EfwZa0jo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["event_general_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_event_general_api"
      ~ last_modified                  = "2023-11-13T14:27:06.631+0000" -> (known after apply)
      ~ source_code_hash               = "ras1zNAnZazf4xHpTsw8aH6c0S4tl1STMdygMXM8fLY=" -> "S+SDQm7gzpVKTqZhIHfVvsGQGYwU4m7HeHMzonpmTZo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["event_invitation_api"].aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = ".lambda-archive/production_event_invitation_api.zip"
      + function_name                  = "production_event_invitation_api"
      + handler                        = "EventPlanr.EventInvitation.Api"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::442019309462:role/production_event_planr_lambda_role"
      + runtime                        = "dotnet6"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "p4+KwLb9Z8ETY57Z8UDftsKzLOWpxPXXKpQsMxoX/TY="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "environment" = "production"
          + "project"     = "event_planr"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASPNETCORE_ENVIRONMENT" = "Production"
            }
        }
    }

  # module.lambda_apis["event_manager_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_event_manager_api"
      ~ last_modified                  = "2023-11-13T14:27:06.630+0000" -> (known after apply)
      ~ source_code_hash               = "IFv9hB9U6bkpTnpkiH1DElHmvnkkhXfa0yghvV2CLcs=" -> "4u16rKoH3pTeWMf82G8wqwe27tx2a8VbkOStkrpcQBM="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["news_post_api"].aws_lambda_function.this will be destroyed
  # (because module.lambda_apis["news_post_api"] is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:442019309462:function:production_news_post_api" -> null
      - filename                       = ".lambda-archive/production_news_post_api.zip" -> null
      - function_name                  = "production_news_post_api" -> null
      - handler                        = "EventPlanr.NewsPost.Api" -> null
      - id                             = "production_news_post_api" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:442019309462:function:production_news_post_api/invocations" -> null
      - last_modified                  = "2023-11-13T14:27:06.621+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:442019309462:function:production_news_post_api:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:442019309462:function:production_news_post_api:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::442019309462:role/production_event_planr_lambda_role" -> null
      - runtime                        = "dotnet6" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Af8SoVfHNxWk+YnenMjXBluO0VE643uT9UA0LYNL5sY=" -> null
      - source_code_size               = 16192192 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "environment" = "production"
          - "project"     = "event_planr"
        } -> null
      - timeout                        = 15 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ASPNETCORE_ENVIRONMENT" = "Production"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.lambda_apis["news_post_manager_api"].aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = ".lambda-archive/production_news_post_manager_api.zip"
      + function_name                  = "production_news_post_manager_api"
      + handler                        = "EventPlanr.NewsPostManager.Api"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::442019309462:role/production_event_planr_lambda_role"
      + runtime                        = "dotnet6"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "v66BV5zYr8PYzo0yKq2cIDn7YWpB4wLRrr9nls0BSp4="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "environment" = "production"
          + "project"     = "event_planr"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASPNETCORE_ENVIRONMENT" = "Production"
            }
        }
    }

  # module.lambda_apis["organization_manager_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_organization_manager_api"
      ~ last_modified                  = "2023-11-13T14:27:06.628+0000" -> (known after apply)
      ~ source_code_hash               = "2ytk8eh0kebIEUS84BndZqFmahM+362KxBqVf+l7oFE=" -> "UFl0jLXh+L9h7eiarXLUaCYpQFKAUDlaq5FV9JiRhU0="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["ticket_manager_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_ticket_manager_api"
      ~ last_modified                  = "2023-11-13T14:27:06.962+0000" -> (known after apply)
      ~ source_code_hash               = "mZ3qowJ5B47r+xz/jpRWlBlWBTty3DRyeGL/jrMXBZ4=" -> "+A3JgCE5yjxjbUJ5gRV0Ld2BAca+/FVTk2EJq+1jmIs="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["ticket_order_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_ticket_order_api"
      ~ last_modified                  = "2023-11-13T14:27:06.633+0000" -> (known after apply)
      ~ source_code_hash               = "dCMFu5UHpafhe3Oj1Wo3xszjf9Gv0LYlo0Tc56hD0eo=" -> "/kAllxLdWWnMRntXUVFsQym+4TdZXrax5s5A03DDXKM="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_apis["user_ticket_api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_user_ticket_api"
      ~ last_modified                  = "2023-11-13T14:27:06.625+0000" -> (known after apply)
      ~ source_code_hash               = "UIJfl3pZoF8AVHjqv5xYupvsBEZG8TiqNKvXRvTXu6c=" -> "aBRCTDM2IsBS5+iFjRJUmRHjJJ2XxcdhF1puy8aGcwY="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pre_token_generation_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_pre_token_generation_function"
      ~ last_modified                  = "2023-11-13T15:43:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "zLiVCQcLCZTc8YxUiQee5ih7YwyrUXUkrouOeAalrP0=" -> "WBCy1Yv7sehTJwZs029l+IdqrXuPZx5xDEb5ElUMSRc="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.reserved_ticket_order_expiration.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "production_reserved_ticket_order_expiration_function"
      ~ last_modified                  = "2023-11-13T14:25:30.863+0000" -> (known after apply)
      ~ source_code_hash               = "820aDI6XwkSGLGVDYEB+htM6PmGTTiJB7JSTC0cTzE4=" -> "Ckwwgkaa1D0nZTXjSBuK4ftvJrRMau1kaiOgCW9Sx6s="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 25 to add, 11 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Error</summary>

```terraform


```

</details>